; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22coredns\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22prefix \22"
module asm "\09.ascii \22go\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22context\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22context\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22context\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22net\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22net\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22net\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22http\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22net/http\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22net/http\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22sync\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22sync\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22sync\22"
module asm "\09.ascii \22\\\22\\n\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !5, globals: !6)
!4 = !DIFile(filename: "lookup.go", directory: "/home")
!5 = !{}
!6 = !{!7, !24, !63, !78, !80, !85, !94}
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !3, file: !9, line: 1, type: !10, isLocal: false, isDefinition: true)
!9 = !DIFile(filename: "<built-in>", directory: "")
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,[3]uint8,bool,bool,uint64}", file: !11, size: 128, align: 8, elements: !12)
!11 = !DIFile(filename: "", directory: "")
!12 = !{!13, !15, !20, !21, !22}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", file: !11, line: 1, baseType: !14, size: 8, align: 8)
!14 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "pad", file: !11, line: 1, baseType: !16, size: 24, align: 8, offset: 8)
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, align: 1, elements: !18)
!17 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!18 = !{!19}
!19 = !DISubrange(count: 3)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "needed", file: !11, line: 1, baseType: !14, size: 8, align: 8, offset: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "cgo", file: !11, line: 1, baseType: !14, size: 8, align: 8, offset: 40)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "alignme", file: !11, line: 1, baseType: !23, size: 64, align: 64, offset: 64)
!23 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "go.coredns.sup", linkageName: "go.coredns.sup", scope: !3, file: !26, line: 512, type: !27, isLocal: true, isDefinition: true)
!26 = !DIFile(filename: "types.go", directory: "")
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: ".go.coredns.supported", file: !26, line: 507, size: 256, align: 8, elements: !29)
!29 = !{!30, !49}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !26, line: 508, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !9, line: 1, size: 384, align: 8, elements: !33)
!33 = !{!34, !36, !37, !38, !40, !42, !45, !46, !48}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !9, line: 1, baseType: !35, size: 64, align: 64)
!35 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !9, line: 1, baseType: !17, size: 8, align: 8, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !9, line: 1, baseType: !17, size: 8, align: 8, offset: 72)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !9, line: 1, baseType: !39, size: 16, align: 16, offset: 80)
!39 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !9, line: 1, baseType: !41, size: 32, align: 32, offset: 96)
!41 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !9, line: 1, baseType: !43, size: 64, align: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "void")
!45 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !9, line: 1, baseType: !43, size: 64, align: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !9, line: 1, baseType: !47, size: 64, align: 64, offset: 256)
!47 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !9, line: 1, baseType: !43, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "RWMutex", file: !26, line: 509, baseType: !50, size: 192, align: 32, offset: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "RWMutex", file: !26, line: 6, size: 192, align: 8, elements: !51)
!51 = !{!52, !59, !60, !61, !62}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "w", file: !26, line: 6, baseType: !53, size: 64, align: 32)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", file: !54, line: 6, size: 64, align: 8, elements: !55)
!54 = !DIFile(filename: "lookup.go", directory: "")
!55 = !{!56, !58}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !54, line: 6, baseType: !57, size: 32, align: 32)
!57 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "sema", file: !54, line: 6, baseType: !41, size: 32, align: 32, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "writerSem", file: !26, line: 6, baseType: !41, size: 32, align: 32, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "readerSem", file: !26, line: 6, baseType: !41, size: 32, align: 32, offset: 96)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "readerCount", file: !26, line: 6, baseType: !57, size: 32, align: 32, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "readerWait", file: !26, line: 6, baseType: !57, size: 32, align: 32, offset: 160)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "go.coredns.CaseRanges", linkageName: "go.coredns.CaseRanges", scope: !3, file: !65, line: 50, type: !66, isLocal: false, isDefinition: true)
!65 = !DIFile(filename: "strings.go", directory: "runtime")
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*CaseRange,int,int}", file: !11, size: 192, align: 8, elements: !67)
!67 = !{!68, !76, !77}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "CaseRange", file: !65, line: 42, size: 160, align: 8, elements: !71)
!71 = !{!72, !73, !74}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Lo", file: !65, line: 43, baseType: !41, size: 32, align: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Hi", file: !65, line: 44, baseType: !41, size: 32, align: 32, offset: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Delta", file: !65, line: 45, baseType: !75, size: 96, align: 32, offset: 64)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 96, align: 4, elements: !18)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !11, line: 1, baseType: !35, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !11, line: 1, baseType: !35, size: 64, align: 64, offset: 128)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "go.coredns._CaseRanges", linkageName: "go.coredns._CaseRanges", scope: !3, file: !65, line: 51, type: !66, isLocal: true, isDefinition: true)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "go.coredns.first", linkageName: "go.coredns.first", scope: !3, file: !65, line: 497, type: !82, isLocal: true, isDefinition: true)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 2048, align: 1, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 256)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "go.coredns.acceptRanges", linkageName: "go.coredns.acceptRanges", scope: !3, file: !65, line: 526, type: !87, isLocal: true, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 256, align: 8, elements: !92)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: ".go.coredns.acceptRange", file: !65, line: 520, size: 16, align: 8, elements: !89)
!89 = !{!90, !91}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "lo", file: !65, line: 521, baseType: !17, size: 8, align: 8)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "hi", file: !65, line: 522, baseType: !17, size: 8, align: 8, offset: 8)
!92 = !{!93}
!93 = !DISubrange(count: 16)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "go.coredns.kindNames", linkageName: "go.coredns.kindNames", scope: !3, file: !96, line: 123, type: !97, isLocal: true, isDefinition: true)
!96 = !DIFile(filename: "types.go", directory: "runtime")
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !11, size: 192, align: 8, elements: !98)
!98 = !{!99, !76, !77}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !9, line: 1, size: 128, align: 8, elements: !102)
!102 = !{!103, !105}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !9, line: 1, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !9, line: 1, baseType: !35, size: 64, align: 64, offset: 64)
!106 = distinct !DISubprogram(name: "coredns.go.coredns.RR_Header..eq", linkageName: "go.coredns.go.coredns.RR_Header..eq", scope: null, file: !9, line: 1, type: !107, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!107 = !DISubroutineType(types: !108)
!108 = !{!14, !43, !43}
!109 = !DILocalVariable(name: "key1", arg: 1, scope: !106, file: !9, line: 1, type: !43)
!110 = !DILocation(line: 0, scope: !106)
!111 = !DILocalVariable(name: "key2", arg: 2, scope: !106, file: !9, line: 1, type: !43)
!112 = !DILocalVariable(name: "$ret169", scope: !106, file: !9, line: 1, type: !14)
!113 = !DILocation(line: 1, column: 1, scope: !106)
!114 = distinct !DISubprogram(name: "coredns.Header..1go.coredns.RR_Header", linkageName: "go.coredns.RR_Header.Header", scope: null, file: !26, line: 104, type: !115, scopeLine: 104, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!115 = !DISubroutineType(types: !116)
!116 = !{!117, !117, !117}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "RR_Header", file: !26, line: 95, size: 256, align: 8, elements: !119)
!119 = !{!120, !121, !122, !123, !124}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !26, line: 96, baseType: !101, size: 128, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Rrtype", file: !26, line: 97, baseType: !39, size: 16, align: 16, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Class", file: !26, line: 98, baseType: !39, size: 16, align: 16, offset: 144)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Ttl", file: !26, line: 99, baseType: !41, size: 32, align: 32, offset: 160)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "Rdlength", file: !26, line: 100, baseType: !39, size: 16, align: 16, offset: 192)
!125 = !DILocalVariable(name: "h", arg: 1, scope: !114, file: !26, line: 104, type: !117)
!126 = !DILocation(line: 0, scope: !114)
!127 = !DILocalVariable(name: "$ret77", scope: !114, file: !26, line: 104, type: !117)
!128 = !DILocation(line: 104, column: 43, scope: !114)
!129 = distinct !DISubprogram(name: "coredns.copy..1go.coredns.RR_Header", linkageName: "go.coredns.RR_Header.copy", scope: null, file: !26, line: 107, type: !130, scopeLine: 107, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!130 = !DISubroutineType(types: !131)
!131 = !{!132, !117, !117}
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "RR", file: !26, line: 59, size: 128, align: 8, elements: !133)
!133 = !{!134, !182}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !26, line: 59, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)*RR_Header,*func(*void)RR}", file: !11, size: 192, align: 8, elements: !137)
!137 = !{!138, !174, !178}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !11, line: 59, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !9, line: 1, size: 512, align: 8, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !147, !148, !149, !155, !156, !157, !173}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !9, line: 1, baseType: !47, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !9, line: 1, baseType: !47, size: 64, align: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !9, line: 1, baseType: !41, size: 32, align: 32, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !9, line: 1, baseType: !17, size: 8, align: 8, offset: 160)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !9, line: 1, baseType: !17, size: 8, align: 8, offset: 168)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !9, line: 1, baseType: !17, size: 8, align: 8, offset: 176)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !9, line: 1, baseType: !17, size: 8, align: 8, offset: 184)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !9, line: 1, baseType: !150, size: 64, align: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !9, line: 1, size: 64, align: 8, elements: !152)
!152 = !{!153}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !9, line: 1, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !9, line: 1, baseType: !104, size: 64, align: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !9, line: 1, baseType: !100, size: 64, align: 64, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !9, line: 1, baseType: !158, size: 64, align: 64, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !9, line: 1, size: 320, align: 8, elements: !160)
!160 = !{!161, !162, !163}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !9, line: 1, baseType: !100, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !9, line: 1, baseType: !100, size: 64, align: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !9, line: 1, baseType: !164, size: 192, align: 64, offset: 128)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !11, size: 192, align: 8, elements: !165)
!165 = !{!166, !76, !77}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !9, line: 1, size: 320, align: 8, elements: !169)
!169 = !{!161, !162, !170, !171, !172}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !9, line: 1, baseType: !43, size: 64, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !9, line: 1, baseType: !43, size: 64, align: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !9, line: 1, baseType: !43, size: 64, align: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !9, line: 1, baseType: !43, size: 64, align: 64, offset: 448)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !11, line: 59, baseType: !175, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!117, !43}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "copy", file: !11, line: 59, baseType: !179, size: 64, align: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!132, !43}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !26, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!183 = !DILocalVariable(name: "h", arg: 1, scope: !129, file: !26, line: 107, type: !117)
!184 = !DILocation(line: 0, scope: !129)
!185 = !DILocalVariable(name: "$ret78", scope: !129, file: !26, line: 107, type: !132)
!186 = !DILocation(line: 107, column: 33, scope: !129)
!187 = distinct !DISubprogram(name: "coredns.go.coredns.SOA..eq", linkageName: "go.coredns.go.coredns.SOA..eq", scope: null, file: !9, line: 1, type: !107, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!188 = !DILocalVariable(name: "key1", arg: 1, scope: !187, file: !9, line: 1, type: !43)
!189 = !DILocation(line: 0, scope: !187)
!190 = !DILocalVariable(name: "key2", arg: 2, scope: !187, file: !9, line: 1, type: !43)
!191 = !DILocalVariable(name: "$ret170", scope: !187, file: !9, line: 1, type: !14)
!192 = !DILocation(line: 1, column: 1, scope: !187)
!193 = distinct !DISubprogram(name: "coredns.Header..1go.coredns.SOA", linkageName: "go.coredns.SOA.Header", scope: null, file: !26, line: 810, type: !194, scopeLine: 810, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!194 = !DISubroutineType(types: !195)
!195 = !{!117, !196, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "SOA", file: !26, line: 625, size: 704, align: 8, elements: !198)
!198 = !{!199, !200, !201, !202, !203, !204, !205, !206}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", file: !26, line: 626, baseType: !118, size: 256, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Ns", file: !26, line: 627, baseType: !101, size: 128, align: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Mbox", file: !26, line: 628, baseType: !101, size: 128, align: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Serial", file: !26, line: 629, baseType: !41, size: 32, align: 32, offset: 512)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "Refresh", file: !26, line: 630, baseType: !41, size: 32, align: 32, offset: 544)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Retry", file: !26, line: 631, baseType: !41, size: 32, align: 32, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Expire", file: !26, line: 632, baseType: !41, size: 32, align: 32, offset: 608)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "Minttl", file: !26, line: 633, baseType: !41, size: 32, align: 32, offset: 640)
!207 = !DILocalVariable(name: "rr", arg: 1, scope: !193, file: !26, line: 810, type: !196)
!208 = !DILocation(line: 0, scope: !193)
!209 = !DILocalVariable(name: "$ret92", scope: !193, file: !26, line: 810, type: !117)
!210 = !DILocation(line: 810, column: 48, scope: !193)
!211 = !DILocation(line: 810, column: 38, scope: !193)
!212 = distinct !DISubprogram(name: "coredns.copy..1go.coredns.SOA", linkageName: "go.coredns.SOA.copy", scope: null, file: !26, line: 893, type: !213, scopeLine: 893, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!213 = !DISubroutineType(types: !214)
!214 = !{!132, !196, !196}
!215 = !DILocalVariable(name: "rr", arg: 1, scope: !212, file: !26, line: 893, type: !196)
!216 = !DILocation(line: 0, scope: !212)
!217 = !DILocalVariable(name: "$ret106", scope: !212, file: !26, line: 893, type: !132)
!218 = !DILocation(line: 895, column: 5, scope: !212)
!219 = !DILocation(line: 896, column: 5, scope: !212)
!220 = !DILocation(line: 897, column: 5, scope: !212)
!221 = !DILocation(line: 898, column: 5, scope: !212)
!222 = !DILocation(line: 899, column: 5, scope: !212)
!223 = !DILocation(line: 900, column: 5, scope: !212)
!224 = !DILocation(line: 901, column: 5, scope: !212)
!225 = !DILocation(line: 902, column: 5, scope: !212)
!226 = !DILocation(line: 894, column: 9, scope: !212)
!227 = !DILocation(line: 894, column: 10, scope: !212)
!228 = !DILocation(line: 894, column: 2, scope: !212)
!229 = distinct !DISubprogram(name: "coredns.go.coredns.CNAME..eq", linkageName: "go.coredns.go.coredns.CNAME..eq", scope: null, file: !9, line: 1, type: !107, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!230 = !DILocalVariable(name: "key1", arg: 1, scope: !229, file: !9, line: 1, type: !43)
!231 = !DILocation(line: 0, scope: !229)
!232 = !DILocalVariable(name: "key2", arg: 2, scope: !229, file: !9, line: 1, type: !43)
!233 = !DILocalVariable(name: "$ret174", scope: !229, file: !9, line: 1, type: !14)
!234 = !DILocation(line: 1, column: 1, scope: !229)
!235 = distinct !DISubprogram(name: "coredns.Header..1go.coredns.CNAME", linkageName: "go.coredns.CNAME.Header", scope: null, file: !26, line: 750, type: !236, scopeLine: 750, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!236 = !DISubroutineType(types: !237)
!237 = !{!117, !238, !238}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "CNAME", file: !26, line: 672, size: 384, align: 8, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", file: !26, line: 673, baseType: !118, size: 256, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Target", file: !26, line: 674, baseType: !101, size: 128, align: 64, offset: 256)
!243 = !DILocalVariable(name: "rr", arg: 1, scope: !235, file: !26, line: 750, type: !238)
!244 = !DILocation(line: 0, scope: !235)
!245 = !DILocalVariable(name: "$ret84", scope: !235, file: !26, line: 750, type: !117)
!246 = !DILocation(line: 750, column: 50, scope: !235)
!247 = !DILocation(line: 750, column: 40, scope: !235)
!248 = distinct !DISubprogram(name: "coredns.copy..1go.coredns.CNAME", linkageName: "go.coredns.CNAME.copy", scope: null, file: !26, line: 860, type: !249, scopeLine: 860, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!249 = !DISubroutineType(types: !250)
!250 = !{!132, !238, !238}
!251 = !DILocalVariable(name: "rr", arg: 1, scope: !248, file: !26, line: 860, type: !238)
!252 = !DILocation(line: 0, scope: !248)
!253 = !DILocalVariable(name: "$ret100", scope: !248, file: !26, line: 860, type: !132)
!254 = !DILocation(line: 861, column: 18, scope: !248)
!255 = !DILocation(line: 861, column: 26, scope: !248)
!256 = !DILocation(line: 861, column: 9, scope: !248)
!257 = !DILocation(line: 861, column: 10, scope: !248)
!258 = !DILocation(line: 861, column: 2, scope: !248)
!259 = distinct !DISubprogram(name: "coredns.go.coredns.DNAME..eq", linkageName: "go.coredns.go.coredns.DNAME..eq", scope: null, file: !9, line: 1, type: !107, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!260 = !DILocalVariable(name: "key1", arg: 1, scope: !259, file: !9, line: 1, type: !43)
!261 = !DILocation(line: 0, scope: !259)
!262 = !DILocalVariable(name: "key2", arg: 2, scope: !259, file: !9, line: 1, type: !43)
!263 = !DILocalVariable(name: "$ret175", scope: !259, file: !9, line: 1, type: !14)
!264 = !DILocation(line: 1, column: 1, scope: !259)
!265 = distinct !DISubprogram(name: "coredns.Header..1go.coredns.DNAME", linkageName: "go.coredns.DNAME.Header", scope: null, file: !26, line: 755, type: !266, scopeLine: 755, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!266 = !DISubroutineType(types: !267)
!267 = !{!117, !268, !268}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "DNAME", file: !26, line: 666, size: 384, align: 8, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", file: !26, line: 667, baseType: !118, size: 256, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Target", file: !26, line: 668, baseType: !101, size: 128, align: 64, offset: 256)
!273 = !DILocalVariable(name: "rr", arg: 1, scope: !265, file: !26, line: 755, type: !268)
!274 = !DILocation(line: 0, scope: !265)
!275 = !DILocalVariable(name: "$ret85", scope: !265, file: !26, line: 755, type: !117)
!276 = !DILocation(line: 755, column: 50, scope: !265)
!277 = !DILocation(line: 755, column: 40, scope: !265)
!278 = distinct !DISubprogram(name: "coredns.copy..1go.coredns.DNAME", linkageName: "go.coredns.DNAME.copy", scope: null, file: !26, line: 863, type: !279, scopeLine: 863, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!279 = !DISubroutineType(types: !280)
!280 = !{!132, !268, !268}
!281 = !DILocalVariable(name: "rr", arg: 1, scope: !278, file: !26, line: 863, type: !268)
!282 = !DILocation(line: 0, scope: !278)
!283 = !DILocalVariable(name: "$ret101", scope: !278, file: !26, line: 863, type: !132)
!284 = !DILocation(line: 864, column: 18, scope: !278)
!285 = !DILocation(line: 864, column: 26, scope: !278)
!286 = !DILocation(line: 864, column: 9, scope: !278)
!287 = !DILocation(line: 864, column: 10, scope: !278)
!288 = !DILocation(line: 864, column: 2, scope: !278)
!289 = distinct !DISubprogram(name: "coredns.Do..1go.coredns.OPT", linkageName: "go.coredns.OPT.Do", scope: null, file: !54, line: 1195, type: !290, scopeLine: 1195, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!290 = !DISubroutineType(types: !291)
!291 = !{!14, !292, !292}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "OPT", file: !26, line: 438, size: 448, align: 8, elements: !294)
!294 = !{!295, !296}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", file: !26, line: 439, baseType: !118, size: 256, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Option", file: !26, line: 440, baseType: !297, size: 192, align: 64, offset: 256)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*EDNS0,int,int}", file: !11, size: 192, align: 8, elements: !298)
!298 = !{!299, !76, !77}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "EDNS0", file: !26, line: 444, size: 128, align: 8, elements: !302)
!302 = !{!303, !182}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !26, line: 444, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)uint16,*func(*void)string,*func(*void)EDNS0}", file: !11, size: 256, align: 8, elements: !306)
!306 = !{!307, !308, !312, !316}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !11, line: 444, baseType: !139, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Option", file: !11, line: 444, baseType: !309, size: 64, align: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!39, !43}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !11, line: 444, baseType: !313, size: 64, align: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!101, !43}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "copy", file: !11, line: 444, baseType: !317, size: 64, align: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!301, !43}
!320 = !DILocalVariable(name: "rr", arg: 1, scope: !289, file: !54, line: 1195, type: !292)
!321 = !DILocation(line: 0, scope: !289)
!322 = !DILocalVariable(name: "$ret56", scope: !289, file: !54, line: 1195, type: !14)
!323 = !DILocation(line: 1196, column: 11, scope: !289)
!324 = !DILocation(line: 1196, column: 15, scope: !289)
!325 = !DILocation(line: 1196, column: 24, scope: !289)
!326 = !DILocation(line: 1196, column: 2, scope: !289)
!327 = distinct !DISubprogram(name: "coredns.Header..1go.coredns.OPT", linkageName: "go.coredns.OPT.Header", scope: null, file: !26, line: 798, type: !328, scopeLine: 798, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!328 = !DISubroutineType(types: !329)
!329 = !{!117, !292, !292}
!330 = !DILocalVariable(name: "rr", arg: 1, scope: !327, file: !26, line: 798, type: !292)
!331 = !DILocation(line: 0, scope: !327)
!332 = !DILocalVariable(name: "$ret90", scope: !327, file: !26, line: 798, type: !117)
!333 = !DILocation(line: 798, column: 48, scope: !327)
!334 = !DILocation(line: 798, column: 38, scope: !327)
!335 = distinct !DISubprogram(name: "coredns.UDPSize..1go.coredns.OPT", linkageName: "go.coredns.OPT.UDPSize", scope: null, file: !54, line: 1190, type: !336, scopeLine: 1190, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!336 = !DISubroutineType(types: !337)
!337 = !{!39, !292, !292}
!338 = !DILocalVariable(name: "rr", arg: 1, scope: !335, file: !54, line: 1190, type: !292)
!339 = !DILocation(line: 0, scope: !335)
!340 = !DILocalVariable(name: "$ret55", scope: !335, file: !54, line: 1190, type: !39)
!341 = !DILocation(line: 1191, column: 11, scope: !335)
!342 = !DILocation(line: 1191, column: 15, scope: !335)
!343 = !DILocation(line: 1191, column: 2, scope: !335)
!344 = distinct !DISubprogram(name: "coredns.copy..1go.coredns.OPT", linkageName: "go.coredns.OPT.copy", scope: null, file: !26, line: 872, type: !345, scopeLine: 872, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!345 = !DISubroutineType(types: !346)
!346 = !{!132, !292, !292}
!347 = !DILocalVariable(name: "rr", arg: 1, scope: !344, file: !26, line: 872, type: !292)
!348 = !DILocation(line: 0, scope: !344)
!349 = !DILocalVariable(name: "$ret104", scope: !344, file: !26, line: 872, type: !132)
!350 = !DILocation(line: 873, column: 32, scope: !351)
!351 = distinct !DILexicalBlock(scope: !344, file: !26, line: 872, column: 1)
!352 = !DILocation(line: 873, column: 12, scope: !351)
!353 = !DILocalVariable(name: "Option", scope: !351, file: !26, line: 873, type: !297)
!354 = !DILocalVariable(name: "i", scope: !355, file: !26, line: 874, type: !35)
!355 = distinct !DILexicalBlock(scope: !351, file: !26, line: 874, column: 2)
!356 = !DILocation(line: 0, scope: !351)
!357 = !DILocalVariable(name: "e", scope: !355, file: !26, line: 874, type: !301)
!358 = !DILocation(line: 874, column: 2, scope: !355)
!359 = !DILocation(line: 875, column: 9, scope: !355)
!360 = !DILocation(line: 875, column: 13, scope: !355)
!361 = !DILocation(line: 875, column: 16, scope: !355)
!362 = !DILocation(line: 877, column: 9, scope: !351)
!363 = !DILocation(line: 877, column: 10, scope: !351)
!364 = !DILocation(line: 877, column: 2, scope: !351)
!365 = distinct !DISubprogram(name: "coredns.go.coredns.NS..eq", linkageName: "go.coredns.go.coredns.NS..eq", scope: null, file: !9, line: 1, type: !107, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!366 = !DILocalVariable(name: "key1", arg: 1, scope: !365, file: !9, line: 1, type: !43)
!367 = !DILocation(line: 0, scope: !365)
!368 = !DILocalVariable(name: "key2", arg: 2, scope: !365, file: !9, line: 1, type: !43)
!369 = !DILocalVariable(name: "$ret176", scope: !365, file: !9, line: 1, type: !14)
!370 = !DILocation(line: 1, column: 1, scope: !365)
!371 = distinct !DISubprogram(name: "coredns.Header..1go.coredns.NS", linkageName: "go.coredns.NS.Header", scope: null, file: !26, line: 788, type: !372, scopeLine: 788, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!372 = !DISubroutineType(types: !373)
!373 = !{!117, !374, !374}
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "NS", file: !26, line: 694, size: 384, align: 8, elements: !376)
!376 = !{!377, !378}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", file: !26, line: 695, baseType: !118, size: 256, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "Ns", file: !26, line: 696, baseType: !101, size: 128, align: 64, offset: 256)
!379 = !DILocalVariable(name: "rr", arg: 1, scope: !371, file: !26, line: 788, type: !374)
!380 = !DILocation(line: 0, scope: !371)
!381 = !DILocalVariable(name: "$ret88", scope: !371, file: !26, line: 788, type: !117)
!382 = !DILocation(line: 788, column: 47, scope: !371)
!383 = !DILocation(line: 788, column: 37, scope: !371)
!384 = distinct !DISubprogram(name: "coredns.copy..1go.coredns.NS", linkageName: "go.coredns.NS.copy", scope: null, file: !26, line: 869, type: !385, scopeLine: 869, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!385 = !DISubroutineType(types: !386)
!386 = !{!132, !374, !374}
!387 = !DILocalVariable(name: "rr", arg: 1, scope: !384, file: !26, line: 869, type: !374)
!388 = !DILocation(line: 0, scope: !384)
!389 = !DILocalVariable(name: "$ret103", scope: !384, file: !26, line: 869, type: !132)
!390 = !DILocation(line: 870, column: 15, scope: !384)
!391 = !DILocation(line: 870, column: 23, scope: !384)
!392 = !DILocation(line: 870, column: 9, scope: !384)
!393 = !DILocation(line: 870, column: 10, scope: !384)
!394 = !DILocation(line: 870, column: 2, scope: !384)
!395 = distinct !DISubprogram(name: "coredns.go.coredns.RRSIG..eq", linkageName: "go.coredns.go.coredns.RRSIG..eq", scope: null, file: !9, line: 1, type: !107, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!396 = !DILocalVariable(name: "key1", arg: 1, scope: !395, file: !9, line: 1, type: !43)
!397 = !DILocation(line: 0, scope: !395)
!398 = !DILocalVariable(name: "key2", arg: 2, scope: !395, file: !9, line: 1, type: !43)
!399 = !DILocalVariable(name: "$ret177", scope: !395, file: !9, line: 1, type: !14)
!400 = !DILocation(line: 1, column: 1, scope: !395)
!401 = distinct !DISubprogram(name: "coredns.Header..1go.coredns.RRSIG", linkageName: "go.coredns.RRSIG.Header", scope: null, file: !26, line: 805, type: !402, scopeLine: 805, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!402 = !DISubroutineType(types: !403)
!403 = !{!117, !404, !404}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "RRSIG", file: !26, line: 700, size: 704, align: 8, elements: !406)
!406 = !{!407, !408, !409, !410, !411, !412, !413, !414, !415, !416}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", file: !26, line: 701, baseType: !118, size: 256, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "TypeCovered", file: !26, line: 702, baseType: !39, size: 16, align: 16, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Algorithm", file: !26, line: 703, baseType: !17, size: 8, align: 8, offset: 272)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Labels", file: !26, line: 704, baseType: !17, size: 8, align: 8, offset: 280)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "OrigTtl", file: !26, line: 705, baseType: !41, size: 32, align: 32, offset: 288)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Expiration", file: !26, line: 706, baseType: !41, size: 32, align: 32, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Inception", file: !26, line: 707, baseType: !41, size: 32, align: 32, offset: 352)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "KeyTag", file: !26, line: 708, baseType: !39, size: 16, align: 16, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "SignerName", file: !26, line: 709, baseType: !101, size: 128, align: 64, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !26, line: 710, baseType: !101, size: 128, align: 64, offset: 576)
!417 = !DILocalVariable(name: "rr", arg: 1, scope: !401, file: !26, line: 805, type: !404)
!418 = !DILocation(line: 0, scope: !401)
!419 = !DILocalVariable(name: "$ret91", scope: !401, file: !26, line: 805, type: !117)
!420 = !DILocation(line: 805, column: 50, scope: !401)
!421 = !DILocation(line: 805, column: 40, scope: !401)
!422 = distinct !DISubprogram(name: "coredns.copy..1go.coredns.RRSIG", linkageName: "go.coredns.RRSIG.copy", scope: null, file: !26, line: 879, type: !423, scopeLine: 879, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!423 = !DISubroutineType(types: !424)
!424 = !{!132, !404, !404}
!425 = !DILocalVariable(name: "rr", arg: 1, scope: !422, file: !26, line: 879, type: !404)
!426 = !DILocation(line: 0, scope: !422)
!427 = !DILocalVariable(name: "$ret105", scope: !422, file: !26, line: 879, type: !132)
!428 = !DILocation(line: 881, column: 5, scope: !422)
!429 = !DILocation(line: 882, column: 5, scope: !422)
!430 = !DILocation(line: 883, column: 5, scope: !422)
!431 = !DILocation(line: 884, column: 5, scope: !422)
!432 = !DILocation(line: 885, column: 5, scope: !422)
!433 = !DILocation(line: 886, column: 5, scope: !422)
!434 = !DILocation(line: 887, column: 5, scope: !422)
!435 = !DILocation(line: 888, column: 5, scope: !422)
!436 = !DILocation(line: 889, column: 5, scope: !422)
!437 = !DILocation(line: 890, column: 5, scope: !422)
!438 = !DILocation(line: 880, column: 9, scope: !422)
!439 = !DILocation(line: 880, column: 10, scope: !422)
!440 = !DILocation(line: 880, column: 2, scope: !422)
!441 = distinct !DISubprogram(name: "coredns.go.coredns.SRV..eq", linkageName: "go.coredns.go.coredns.SRV..eq", scope: null, file: !9, line: 1, type: !107, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!442 = !DILocalVariable(name: "key1", arg: 1, scope: !441, file: !9, line: 1, type: !43)
!443 = !DILocation(line: 0, scope: !441)
!444 = !DILocalVariable(name: "key2", arg: 2, scope: !441, file: !9, line: 1, type: !43)
!445 = !DILocalVariable(name: "$ret178", scope: !441, file: !9, line: 1, type: !14)
!446 = !DILocation(line: 1, column: 1, scope: !441)
!447 = distinct !DISubprogram(name: "coredns.Header..1go.coredns.SRV", linkageName: "go.coredns.SRV.Header", scope: null, file: !26, line: 813, type: !448, scopeLine: 813, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!448 = !DISubroutineType(types: !449)
!449 = !{!117, !450, !450}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "SRV", file: !26, line: 678, size: 448, align: 8, elements: !452)
!452 = !{!453, !454, !455, !456, !457}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", file: !26, line: 679, baseType: !118, size: 256, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Priority", file: !26, line: 680, baseType: !39, size: 16, align: 16, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Weight", file: !26, line: 681, baseType: !39, size: 16, align: 16, offset: 272)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Port", file: !26, line: 682, baseType: !39, size: 16, align: 16, offset: 288)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Target", file: !26, line: 683, baseType: !101, size: 128, align: 64, offset: 320)
!458 = !DILocalVariable(name: "rr", arg: 1, scope: !447, file: !26, line: 813, type: !450)
!459 = !DILocation(line: 0, scope: !447)
!460 = !DILocalVariable(name: "$ret93", scope: !447, file: !26, line: 813, type: !117)
!461 = !DILocation(line: 813, column: 48, scope: !447)
!462 = !DILocation(line: 813, column: 38, scope: !447)
!463 = distinct !DISubprogram(name: "coredns.copy..1go.coredns.SRV", linkageName: "go.coredns.SRV.copy", scope: null, file: !26, line: 905, type: !464, scopeLine: 905, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!464 = !DISubroutineType(types: !465)
!465 = !{!132, !450, !450}
!466 = !DILocalVariable(name: "rr", arg: 1, scope: !463, file: !26, line: 905, type: !450)
!467 = !DILocation(line: 0, scope: !463)
!468 = !DILocalVariable(name: "$ret107", scope: !463, file: !26, line: 905, type: !132)
!469 = !DILocation(line: 907, column: 5, scope: !463)
!470 = !DILocation(line: 908, column: 5, scope: !463)
!471 = !DILocation(line: 909, column: 5, scope: !463)
!472 = !DILocation(line: 910, column: 5, scope: !463)
!473 = !DILocation(line: 911, column: 5, scope: !463)
!474 = !DILocation(line: 906, column: 9, scope: !463)
!475 = !DILocation(line: 906, column: 10, scope: !463)
!476 = !DILocation(line: 906, column: 2, scope: !463)
!477 = distinct !DISubprogram(name: "coredns.go.coredns.MX..eq", linkageName: "go.coredns.go.coredns.MX..eq", scope: null, file: !9, line: 1, type: !107, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!478 = !DILocalVariable(name: "key1", arg: 1, scope: !477, file: !9, line: 1, type: !43)
!479 = !DILocation(line: 0, scope: !477)
!480 = !DILocalVariable(name: "key2", arg: 2, scope: !477, file: !9, line: 1, type: !43)
!481 = !DILocalVariable(name: "$ret179", scope: !477, file: !9, line: 1, type: !14)
!482 = !DILocation(line: 1, column: 1, scope: !477)
!483 = distinct !DISubprogram(name: "coredns.Header..1go.coredns.MX", linkageName: "go.coredns.MX.Header", scope: null, file: !26, line: 782, type: !484, scopeLine: 782, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!484 = !DISubroutineType(types: !485)
!485 = !{!117, !486, !486}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "MX", file: !26, line: 687, size: 448, align: 8, elements: !488)
!488 = !{!489, !490, !491}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", file: !26, line: 688, baseType: !118, size: 256, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Preference", file: !26, line: 689, baseType: !39, size: 16, align: 16, offset: 256)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "Mx", file: !26, line: 690, baseType: !101, size: 128, align: 64, offset: 320)
!492 = !DILocalVariable(name: "rr", arg: 1, scope: !483, file: !26, line: 782, type: !486)
!493 = !DILocation(line: 0, scope: !483)
!494 = !DILocalVariable(name: "$ret87", scope: !483, file: !26, line: 782, type: !117)
!495 = !DILocation(line: 782, column: 47, scope: !483)
!496 = !DILocation(line: 782, column: 37, scope: !483)
!497 = distinct !DISubprogram(name: "coredns.copy..1go.coredns.MX", linkageName: "go.coredns.MX.copy", scope: null, file: !26, line: 866, type: !498, scopeLine: 866, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!498 = !DISubroutineType(types: !499)
!499 = !{!132, !486, !486}
!500 = !DILocalVariable(name: "rr", arg: 1, scope: !497, file: !26, line: 866, type: !486)
!501 = !DILocation(line: 0, scope: !497)
!502 = !DILocalVariable(name: "$ret102", scope: !497, file: !26, line: 866, type: !132)
!503 = !DILocation(line: 867, column: 15, scope: !497)
!504 = !DILocation(line: 867, column: 23, scope: !497)
!505 = !DILocation(line: 867, column: 38, scope: !497)
!506 = !DILocation(line: 867, column: 9, scope: !497)
!507 = !DILocation(line: 867, column: 10, scope: !497)
!508 = !DILocation(line: 867, column: 2, scope: !497)
!509 = distinct !DISubprogram(name: "coredns.go.coredns.EDNS0_COOKIE..eq", linkageName: "go.coredns.go.coredns.EDNS0_COOKIE..eq", scope: null, file: !9, line: 1, type: !107, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!510 = !DILocalVariable(name: "key1", arg: 1, scope: !509, file: !9, line: 1, type: !43)
!511 = !DILocation(line: 0, scope: !509)
!512 = !DILocalVariable(name: "key2", arg: 2, scope: !509, file: !9, line: 1, type: !43)
!513 = !DILocalVariable(name: "$ret182", scope: !509, file: !9, line: 1, type: !14)
!514 = !DILocation(line: 1, column: 1, scope: !509)
!515 = distinct !DISubprogram(name: "coredns.Option..1go.coredns.EDNS0_COOKIE", linkageName: "go.coredns.EDNS0_COOKIE.Option", scope: null, file: !26, line: 490, type: !516, scopeLine: 490, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!516 = !DISubroutineType(types: !517)
!517 = !{!39, !518, !518}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "EDNS0_COOKIE", file: !26, line: 476, size: 192, align: 8, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Code", file: !26, line: 477, baseType: !39, size: 16, align: 16)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Cookie", file: !26, line: 478, baseType: !101, size: 128, align: 64, offset: 64)
!523 = !DILocalVariable(name: "e", arg: 1, scope: !515, file: !26, line: 490, type: !518)
!524 = !DILocation(line: 0, scope: !515)
!525 = !DILocalVariable(name: "$ret79", scope: !515, file: !26, line: 490, type: !39)
!526 = !DILocation(line: 490, column: 49, scope: !515)
!527 = distinct !DISubprogram(name: "coredns.String..1go.coredns.EDNS0_COOKIE", linkageName: "go.coredns.EDNS0_COOKIE.String", scope: null, file: !26, line: 492, type: !528, scopeLine: 492, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!528 = !DISubroutineType(types: !529)
!529 = !{!101, !518, !518}
!530 = !DILocalVariable(name: "e", arg: 1, scope: !527, file: !26, line: 492, type: !518)
!531 = !DILocation(line: 0, scope: !527)
!532 = !DILocalVariable(name: "$ret80", scope: !527, file: !26, line: 492, type: !101)
!533 = !DILocation(line: 492, column: 57, scope: !527)
!534 = !DILocation(line: 492, column: 49, scope: !527)
!535 = distinct !DISubprogram(name: "coredns.copy..1go.coredns.EDNS0_COOKIE", linkageName: "go.coredns.EDNS0_COOKIE.copy", scope: null, file: !26, line: 493, type: !536, scopeLine: 493, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!536 = !DISubroutineType(types: !537)
!537 = !{!301, !518, !518}
!538 = !DILocalVariable(name: "e", arg: 1, scope: !535, file: !26, line: 493, type: !518)
!539 = !DILocation(line: 0, scope: !535)
!540 = !DILocalVariable(name: "$ret81", scope: !535, file: !26, line: 493, type: !301)
!541 = !DILocation(line: 493, column: 71, scope: !535)
!542 = !DILocation(line: 493, column: 79, scope: !535)
!543 = !DILocation(line: 493, column: 56, scope: !535)
!544 = !DILocation(line: 493, column: 57, scope: !535)
!545 = !DILocation(line: 493, column: 49, scope: !535)
!546 = distinct !DISubprogram(name: "coredns.Header..1go.coredns.A", linkageName: "go.coredns.A.Header", scope: null, file: !26, line: 739, type: !547, scopeLine: 739, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!547 = !DISubroutineType(types: !548)
!548 = !{!117, !549, !549}
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "A", file: !26, line: 613, size: 448, align: 8, elements: !551)
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", file: !26, line: 614, baseType: !118, size: 256, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "A", file: !26, line: 615, baseType: !554, size: 192, align: 64, offset: 256)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !54, line: 6, size: 192, align: 8, elements: !555)
!555 = !{!556, !557, !558}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !54, line: 1, baseType: !104, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !54, line: 1, baseType: !35, size: 64, align: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !54, line: 1, baseType: !35, size: 64, align: 64, offset: 128)
!559 = !DILocalVariable(name: "rr", arg: 1, scope: !546, file: !26, line: 739, type: !549)
!560 = !DILocation(line: 0, scope: !546)
!561 = !DILocalVariable(name: "$ret82", scope: !546, file: !26, line: 739, type: !117)
!562 = !DILocation(line: 739, column: 55, scope: !546)
!563 = !DILocation(line: 739, column: 45, scope: !546)
!564 = distinct !DISubprogram(name: "coredns.copy..1go.coredns.A", linkageName: "go.coredns.A.copy", scope: null, file: !26, line: 852, type: !565, scopeLine: 852, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!565 = !DISubroutineType(types: !566)
!566 = !{!132, !549, !549}
!567 = !DILocalVariable(name: "rr", arg: 1, scope: !564, file: !26, line: 852, type: !549)
!568 = !DILocation(line: 0, scope: !564)
!569 = !DILocalVariable(name: "$ret98", scope: !564, file: !26, line: 852, type: !132)
!570 = !DILocation(line: 853, column: 30, scope: !564)
!571 = !DILocation(line: 853, column: 20, scope: !564)
!572 = !DILocation(line: 853, column: 9, scope: !564)
!573 = !DILocation(line: 853, column: 10, scope: !564)
!574 = !DILocation(line: 853, column: 2, scope: !564)
!575 = distinct !DISubprogram(name: "coredns.Header..1go.coredns.AAAA", linkageName: "go.coredns.AAAA.Header", scope: null, file: !26, line: 740, type: !576, scopeLine: 740, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!576 = !DISubroutineType(types: !577)
!577 = !{!117, !578, !578}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "AAAA", file: !26, line: 619, size: 448, align: 8, elements: !580)
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", file: !26, line: 620, baseType: !118, size: 256, align: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "AAAA", file: !26, line: 621, baseType: !554, size: 192, align: 64, offset: 256)
!583 = !DILocalVariable(name: "rr", arg: 1, scope: !575, file: !26, line: 740, type: !578)
!584 = !DILocation(line: 0, scope: !575)
!585 = !DILocalVariable(name: "$ret83", scope: !575, file: !26, line: 740, type: !117)
!586 = !DILocation(line: 740, column: 55, scope: !575)
!587 = !DILocation(line: 740, column: 45, scope: !575)
!588 = distinct !DISubprogram(name: "coredns.copy..1go.coredns.AAAA", linkageName: "go.coredns.AAAA.copy", scope: null, file: !26, line: 856, type: !589, scopeLine: 856, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!589 = !DISubroutineType(types: !590)
!590 = !{!132, !578, !578}
!591 = !DILocalVariable(name: "rr", arg: 1, scope: !588, file: !26, line: 856, type: !578)
!592 = !DILocation(line: 0, scope: !588)
!593 = !DILocalVariable(name: "$ret99", scope: !588, file: !26, line: 856, type: !132)
!594 = !DILocation(line: 857, column: 33, scope: !588)
!595 = !DILocation(line: 857, column: 23, scope: !588)
!596 = !DILocation(line: 857, column: 9, scope: !588)
!597 = !DILocation(line: 857, column: 10, scope: !588)
!598 = !DILocation(line: 857, column: 2, scope: !588)
!599 = distinct !DISubprogram(name: "coredns.Header..1go.coredns.TXT", linkageName: "go.coredns.TXT.Header", scope: null, file: !26, line: 823, type: !600, scopeLine: 823, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!600 = !DISubroutineType(types: !601)
!601 = !{!117, !602, !602}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "TXT", file: !26, line: 714, size: 448, align: 8, elements: !604)
!604 = !{!605, !606}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", file: !26, line: 715, baseType: !118, size: 256, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "Txt", file: !26, line: 716, baseType: !97, size: 192, align: 64, offset: 256)
!607 = !DILocalVariable(name: "rr", arg: 1, scope: !599, file: !26, line: 823, type: !602)
!608 = !DILocation(line: 0, scope: !599)
!609 = !DILocalVariable(name: "$ret94", scope: !599, file: !26, line: 823, type: !117)
!610 = !DILocation(line: 823, column: 55, scope: !599)
!611 = !DILocation(line: 823, column: 45, scope: !599)
!612 = distinct !DISubprogram(name: "coredns.copy..1go.coredns.TXT", linkageName: "go.coredns.TXT.copy", scope: null, file: !26, line: 915, type: !613, scopeLine: 915, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!613 = !DISubroutineType(types: !614)
!614 = !{!132, !602, !602}
!615 = !DILocalVariable(name: "s", arg: 1, scope: !616, file: !26, line: 837, type: !97)
!616 = distinct !DISubprogram(name: "coredns.cloneStringSlice", scope: null, file: !26, line: 837, type: !617, scopeLine: 837, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !5)
!617 = !DISubroutineType(types: !618)
!618 = !{!97, !97}
!619 = !DILocation(line: 837, column: 23, scope: !616, inlinedAt: !620)
!620 = distinct !DILocation(line: 916, column: 22, scope: !612)
!621 = !DILocalVariable(name: "rr", arg: 1, scope: !612, file: !26, line: 915, type: !602)
!622 = !DILocation(line: 0, scope: !612)
!623 = !DILocalVariable(name: "$ret108", scope: !612, file: !26, line: 915, type: !132)
!624 = !DILocation(line: 916, column: 41, scope: !612)
!625 = !DILocation(line: 0, scope: !616, inlinedAt: !620)
!626 = !DILocalVariable(name: "$ret96", scope: !616, file: !26, line: 837, type: !97)
!627 = !DILocation(line: 838, column: 7, scope: !616, inlinedAt: !620)
!628 = !DILocation(line: 839, column: 3, scope: !616, inlinedAt: !620)
!629 = !DILocation(line: 841, column: 9, scope: !616, inlinedAt: !620)
!630 = !DILocation(line: 841, column: 2, scope: !616, inlinedAt: !620)
!631 = !DILocation(line: 916, column: 9, scope: !612)
!632 = !DILocation(line: 916, column: 10, scope: !612)
!633 = !DILocation(line: 916, column: 2, scope: !612)
!634 = distinct !DISubprogram(name: "coredns.go.coredns.DS..eq", linkageName: "go.coredns.go.coredns.DS..eq", scope: null, file: !9, line: 1, type: !107, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!635 = !DILocalVariable(name: "key1", arg: 1, scope: !634, file: !9, line: 1, type: !43)
!636 = !DILocation(line: 0, scope: !634)
!637 = !DILocalVariable(name: "key2", arg: 2, scope: !634, file: !9, line: 1, type: !43)
!638 = !DILocalVariable(name: "$ret183", scope: !634, file: !9, line: 1, type: !14)
!639 = !DILocation(line: 1, column: 1, scope: !634)
!640 = distinct !DISubprogram(name: "coredns.Header..1go.coredns.DS", linkageName: "go.coredns.DS.Header", scope: null, file: !26, line: 759, type: !641, scopeLine: 759, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!641 = !DISubroutineType(types: !642)
!642 = !{!117, !643, !643}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "DS", file: !26, line: 720, size: 448, align: 8, elements: !645)
!645 = !{!646, !647, !648, !649, !650}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", file: !26, line: 721, baseType: !118, size: 256, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "KeyTag", file: !26, line: 722, baseType: !39, size: 16, align: 16, offset: 256)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "Algorithm", file: !26, line: 723, baseType: !17, size: 8, align: 8, offset: 272)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "DigestType", file: !26, line: 724, baseType: !17, size: 8, align: 8, offset: 280)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Digest", file: !26, line: 725, baseType: !101, size: 128, align: 64, offset: 320)
!651 = !DILocalVariable(name: "rr", arg: 1, scope: !640, file: !26, line: 759, type: !643)
!652 = !DILocation(line: 0, scope: !640)
!653 = !DILocalVariable(name: "$ret86", scope: !640, file: !26, line: 759, type: !117)
!654 = !DILocation(line: 759, column: 55, scope: !640)
!655 = !DILocation(line: 759, column: 45, scope: !640)
!656 = distinct !DISubprogram(name: "coredns.copy..1go.coredns.DS", linkageName: "go.coredns.DS.copy", scope: null, file: !26, line: 919, type: !657, scopeLine: 919, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!657 = !DISubroutineType(types: !658)
!658 = !{!132, !643, !643}
!659 = !DILocalVariable(name: "rr", arg: 1, scope: !656, file: !26, line: 919, type: !643)
!660 = !DILocation(line: 0, scope: !656)
!661 = !DILocalVariable(name: "$ret109", scope: !656, file: !26, line: 919, type: !132)
!662 = !DILocation(line: 921, column: 5, scope: !656)
!663 = !DILocation(line: 922, column: 5, scope: !656)
!664 = !DILocation(line: 923, column: 5, scope: !656)
!665 = !DILocation(line: 924, column: 5, scope: !656)
!666 = !DILocation(line: 925, column: 5, scope: !656)
!667 = !DILocation(line: 920, column: 9, scope: !656)
!668 = !DILocation(line: 920, column: 10, scope: !656)
!669 = !DILocation(line: 920, column: 2, scope: !656)
!670 = distinct !DISubprogram(name: "coredns.Header..1go.coredns.NSEC", linkageName: "go.coredns.NSEC.Header", scope: null, file: !26, line: 792, type: !671, scopeLine: 792, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!671 = !DISubroutineType(types: !672)
!672 = !{!117, !673, !673}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "NSEC", file: !26, line: 729, size: 576, align: 8, elements: !675)
!675 = !{!676, !677, !678}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", file: !26, line: 730, baseType: !118, size: 256, align: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "NextDomain", file: !26, line: 731, baseType: !101, size: 128, align: 64, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "TypeBitMap", file: !26, line: 732, baseType: !679, size: 192, align: 64, offset: 384)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint16,int,int}", file: !11, size: 192, align: 8, elements: !680)
!680 = !{!681, !76, !77}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !682, size: 64, align: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!683 = !DILocalVariable(name: "rr", arg: 1, scope: !670, file: !26, line: 792, type: !673)
!684 = !DILocation(line: 0, scope: !670)
!685 = !DILocalVariable(name: "$ret89", scope: !670, file: !26, line: 792, type: !117)
!686 = !DILocation(line: 792, column: 55, scope: !670)
!687 = !DILocation(line: 792, column: 45, scope: !670)
!688 = distinct !DISubprogram(name: "coredns.copy..1go.coredns.NSEC", linkageName: "go.coredns.NSEC.copy", scope: null, file: !26, line: 929, type: !689, scopeLine: 929, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!689 = !DISubroutineType(types: !690)
!690 = !{!132, !673, !673}
!691 = !DILocalVariable(name: "rr", arg: 1, scope: !688, file: !26, line: 929, type: !673)
!692 = !DILocation(line: 0, scope: !688)
!693 = !DILocalVariable(name: "$ret110", scope: !688, file: !26, line: 929, type: !132)
!694 = !DILocation(line: 930, column: 54, scope: !688)
!695 = !DILocation(line: 844, column: 20, scope: !696, inlinedAt: !699)
!696 = distinct !DISubprogram(name: "coredns.cloneU16Slice", scope: null, file: !26, line: 844, type: !697, scopeLine: 844, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !5)
!697 = !DISubroutineType(types: !698)
!698 = !{!679, !679}
!699 = distinct !DILocation(line: 930, column: 38, scope: !688)
!700 = !DILocalVariable(name: "s", arg: 1, scope: !696, file: !26, line: 844, type: !679)
!701 = !DILocation(line: 0, scope: !696, inlinedAt: !699)
!702 = !DILocalVariable(name: "$ret97", scope: !696, file: !26, line: 844, type: !679)
!703 = !DILocation(line: 845, column: 7, scope: !696, inlinedAt: !699)
!704 = !DILocation(line: 846, column: 3, scope: !696, inlinedAt: !699)
!705 = !DILocation(line: 848, column: 9, scope: !696, inlinedAt: !699)
!706 = !DILocation(line: 848, column: 2, scope: !696, inlinedAt: !699)
!707 = !DILocation(line: 930, column: 25, scope: !688)
!708 = !DILocation(line: 930, column: 9, scope: !688)
!709 = !DILocation(line: 930, column: 10, scope: !688)
!710 = !DILocation(line: 930, column: 2, scope: !688)
!711 = distinct !DISubprogram(name: "coredns.Copy..1go.coredns.Msg", linkageName: "go.coredns.Msg.Copy", scope: null, file: !54, line: 1297, type: !712, scopeLine: 1297, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!712 = !DISubroutineType(types: !713)
!713 = !{!714, !714, !714}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "Msg", file: !26, line: 34, size: 1088, align: 8, elements: !716)
!716 = !{!717, !731, !732, !742, !747, !748}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "MsgHdr", file: !26, line: 35, baseType: !718, size: 256, align: 64)
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "MsgHdr", file: !26, line: 44, size: 256, align: 8, elements: !719)
!719 = !{!720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !26, line: 45, baseType: !39, size: 16, align: 16)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "Response", file: !26, line: 46, baseType: !14, size: 8, align: 8, offset: 16)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "Opcode", file: !26, line: 47, baseType: !35, size: 64, align: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "Authoritative", file: !26, line: 48, baseType: !14, size: 8, align: 8, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "Truncated", file: !26, line: 49, baseType: !14, size: 8, align: 8, offset: 136)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "RecursionDesired", file: !26, line: 50, baseType: !14, size: 8, align: 8, offset: 144)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "RecursionAvailable", file: !26, line: 51, baseType: !14, size: 8, align: 8, offset: 152)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "Zero", file: !26, line: 52, baseType: !14, size: 8, align: 8, offset: 160)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "AuthenticatedData", file: !26, line: 53, baseType: !14, size: 8, align: 8, offset: 168)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "CheckingDisabled", file: !26, line: 54, baseType: !14, size: 8, align: 8, offset: 176)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Rcode", file: !26, line: 55, baseType: !35, size: 64, align: 64, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "Compress", file: !26, line: 36, baseType: !14, size: 8, align: 8, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Question", file: !26, line: 37, baseType: !733, size: 192, align: 64, offset: 320)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Question,int,int}", file: !11, size: 192, align: 8, elements: !734)
!734 = !{!735, !76, !77}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !736, size: 64, align: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "Question", file: !26, line: 125, size: 192, align: 8, elements: !738)
!738 = !{!739, !740, !741}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !26, line: 126, baseType: !101, size: 128, align: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "Qtype", file: !26, line: 127, baseType: !39, size: 16, align: 16, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "Qclass", file: !26, line: 128, baseType: !39, size: 16, align: 16, offset: 144)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Answer", file: !26, line: 38, baseType: !743, size: 192, align: 64, offset: 512)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*RR,int,int}", file: !11, size: 192, align: 8, elements: !744)
!744 = !{!745, !76, !77}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !746, size: 64, align: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Ns", file: !26, line: 39, baseType: !743, size: 192, align: 64, offset: 704)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "Extra", file: !26, line: 40, baseType: !743, size: 192, align: 64, offset: 896)
!749 = !DILocalVariable(name: "dns", arg: 1, scope: !711, file: !54, line: 1297, type: !714)
!750 = !DILocation(line: 0, scope: !711)
!751 = !DILocalVariable(name: "$ret66", scope: !711, file: !54, line: 1297, type: !714)
!752 = !DILocation(line: 1297, column: 49, scope: !711)
!753 = !DILocation(line: 1297, column: 41, scope: !711)
!754 = !DILocation(line: 1297, column: 31, scope: !711)
!755 = distinct !DISubprogram(name: "coredns.CopyTo..1go.coredns.Msg", linkageName: "go.coredns.Msg.CopyTo", scope: null, file: !54, line: 1300, type: !756, scopeLine: 1300, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!756 = !DISubroutineType(types: !757)
!757 = !{!714, !714, !714, !714}
!758 = !DILocalVariable(name: "s", arg: 1, scope: !759, file: !54, line: 1331, type: !733)
!759 = distinct !DISubprogram(name: "coredns.cloneSlice", scope: null, file: !54, line: 1331, type: !760, scopeLine: 1331, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !5)
!760 = !DISubroutineType(types: !761)
!761 = !{!733, !733}
!762 = !DILocation(line: 1331, column: 17, scope: !759, inlinedAt: !763)
!763 = distinct !DILocation(line: 1306, column: 17, scope: !764)
!764 = distinct !DILexicalBlock(scope: !755, file: !54, line: 1300, column: 1)
!765 = !DILocalVariable(name: "dns", arg: 1, scope: !755, file: !54, line: 1300, type: !714)
!766 = !DILocation(line: 0, scope: !755)
!767 = !DILocalVariable(name: "r1", arg: 2, scope: !755, file: !54, line: 1300, type: !714)
!768 = !DILocalVariable(name: "$ret67", scope: !755, file: !54, line: 1300, type: !714)
!769 = !DILocation(line: 1301, column: 4, scope: !764)
!770 = !DILocation(line: 1301, column: 17, scope: !764)
!771 = !DILocation(line: 1301, column: 12, scope: !764)
!772 = !DILocation(line: 1302, column: 4, scope: !764)
!773 = !DILocation(line: 1302, column: 19, scope: !764)
!774 = !DILocation(line: 1302, column: 14, scope: !764)
!775 = !DILocation(line: 1304, column: 12, scope: !764)
!776 = !DILocation(line: 1304, column: 23, scope: !764)
!777 = !DILocation(line: 0, scope: !759, inlinedAt: !763)
!778 = !DILocalVariable(name: "$ret68", scope: !759, file: !54, line: 1331, type: !733)
!779 = !DILocation(line: 1332, column: 7, scope: !759, inlinedAt: !763)
!780 = !DILocation(line: 1333, column: 3, scope: !759, inlinedAt: !763)
!781 = !DILocation(line: 1335, column: 9, scope: !759, inlinedAt: !763)
!782 = !DILocation(line: 1335, column: 2, scope: !759, inlinedAt: !763)
!783 = !DILocation(line: 1306, column: 5, scope: !764)
!784 = !DILocation(line: 1306, column: 15, scope: !764)
!785 = !DILocation(line: 1309, column: 29, scope: !764)
!786 = !DILocation(line: 1309, column: 45, scope: !764)
!787 = !DILocation(line: 1309, column: 57, scope: !764)
!788 = !DILocation(line: 1309, column: 37, scope: !764)
!789 = !DILocation(line: 1309, column: 49, scope: !764)
!790 = !DILocation(line: 1309, column: 11, scope: !764)
!791 = !DILocalVariable(name: "rrArr", scope: !764, file: !54, line: 1309, type: !743)
!792 = !DILocation(line: 1310, column: 37, scope: !764)
!793 = !DILocation(line: 1310, column: 26, scope: !764)
!794 = !DILocation(line: 1310, column: 53, scope: !764)
!795 = !DILocation(line: 1310, column: 4, scope: !764)
!796 = !DILocation(line: 1310, column: 19, scope: !764)
!797 = !DILocation(line: 1311, column: 33, scope: !764)
!798 = !DILocation(line: 1311, column: 22, scope: !764)
!799 = !DILocation(line: 1311, column: 45, scope: !764)
!800 = !DILocation(line: 1311, column: 4, scope: !764)
!801 = !DILocation(line: 1311, column: 15, scope: !764)
!802 = !DILocation(line: 1312, column: 29, scope: !764)
!803 = !DILocation(line: 1312, column: 4, scope: !764)
!804 = !DILocation(line: 1312, column: 18, scope: !764)
!805 = !DILocation(line: 1312, column: 11, scope: !764)
!806 = !DILocalVariable(name: "r", scope: !807, file: !54, line: 1314, type: !132)
!807 = distinct !DILexicalBlock(scope: !764, file: !54, line: 1314, column: 2)
!808 = !DILocation(line: 0, scope: !764)
!809 = !DILocation(line: 1314, column: 2, scope: !807)
!810 = !DILocation(line: 0, scope: !807)
!811 = !DILocation(line: 1315, column: 15, scope: !807)
!812 = !DILocation(line: 1315, column: 34, scope: !807)
!813 = !DILocalVariable(name: "r", scope: !814, file: !54, line: 1318, type: !132)
!814 = distinct !DILexicalBlock(scope: !764, file: !54, line: 1318, column: 2)
!815 = !DILocation(line: 1318, column: 2, scope: !814)
!816 = !DILocation(line: 0, scope: !814)
!817 = !DILocation(line: 1319, column: 11, scope: !814)
!818 = !DILocation(line: 1319, column: 26, scope: !814)
!819 = !DILocalVariable(name: "r", scope: !820, file: !54, line: 1322, type: !132)
!820 = distinct !DILexicalBlock(scope: !764, file: !54, line: 1322, column: 2)
!821 = !DILocation(line: 1322, column: 2, scope: !820)
!822 = !DILocation(line: 0, scope: !820)
!823 = !DILocation(line: 1323, column: 14, scope: !820)
!824 = !DILocation(line: 1323, column: 32, scope: !820)
!825 = !DILocation(line: 1326, column: 2, scope: !764)
!826 = distinct !DISubprogram(name: "coredns.IsEdns0..1go.coredns.Msg", linkageName: "go.coredns.Msg.IsEdns0", scope: null, file: !54, line: 1177, type: !827, scopeLine: 1177, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!827 = !DISubroutineType(types: !828)
!828 = !{!292, !714, !714}
!829 = !DILocalVariable(name: "dns", arg: 1, scope: !826, file: !54, line: 1177, type: !714)
!830 = !DILocation(line: 0, scope: !826)
!831 = !DILocalVariable(name: "$ret54", scope: !826, file: !54, line: 1177, type: !292)
!832 = !DILocation(line: 1181, column: 18, scope: !833)
!833 = distinct !DILexicalBlock(scope: !826, file: !54, line: 1181, column: 2)
!834 = !DILocalVariable(name: "i", scope: !833, file: !54, line: 1181, type: !35)
!835 = !DILocation(line: 0, scope: !833)
!836 = !DILocation(line: 1181, column: 33, scope: !833)
!837 = !DILocation(line: 1182, column: 18, scope: !833)
!838 = !DILocation(line: 1182, column: 27, scope: !833)
!839 = !DILocation(line: 1182, column: 15, scope: !833)
!840 = !DILocation(line: 1182, column: 35, scope: !833)
!841 = !DILocation(line: 1183, column: 20, scope: !833)
!842 = !DILocation(line: 1183, column: 23, scope: !833)
!843 = !DILocation(line: 1183, column: 4, scope: !833)
!844 = distinct !DISubprogram(name: "coredns.SetReply..1go.coredns.Msg", linkageName: "go.coredns.Msg.SetReply", scope: null, file: !54, line: 968, type: !756, scopeLine: 968, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!845 = !DILocalVariable(name: "dns", arg: 1, scope: !844, file: !54, line: 968, type: !714)
!846 = !DILocation(line: 0, scope: !844)
!847 = !DILocalVariable(name: "request", arg: 2, scope: !844, file: !54, line: 968, type: !714)
!848 = !DILocalVariable(name: "$ret47", scope: !844, file: !54, line: 968, type: !714)
!849 = !DILocation(line: 969, column: 5, scope: !844)
!850 = !DILocation(line: 969, column: 18, scope: !844)
!851 = !DILocation(line: 969, column: 9, scope: !844)
!852 = !DILocation(line: 970, column: 5, scope: !844)
!853 = !DILocation(line: 970, column: 15, scope: !844)
!854 = !DILocation(line: 971, column: 5, scope: !844)
!855 = !DILocation(line: 971, column: 22, scope: !844)
!856 = !DILocation(line: 971, column: 13, scope: !844)
!857 = !DILocation(line: 972, column: 16, scope: !844)
!858 = !DILocation(line: 973, column: 6, scope: !844)
!859 = !DILocation(line: 973, column: 33, scope: !844)
!860 = !DILocation(line: 973, column: 24, scope: !844)
!861 = !DILocation(line: 974, column: 6, scope: !844)
!862 = !DILocation(line: 974, column: 33, scope: !844)
!863 = !DILocation(line: 974, column: 24, scope: !844)
!864 = !DILocation(line: 976, column: 5, scope: !844)
!865 = !DILocation(line: 976, column: 12, scope: !844)
!866 = !DILocation(line: 977, column: 16, scope: !844)
!867 = !DILocation(line: 977, column: 27, scope: !844)
!868 = !DILocation(line: 978, column: 18, scope: !844)
!869 = !DILocation(line: 978, column: 6, scope: !844)
!870 = !DILocation(line: 978, column: 16, scope: !844)
!871 = !DILocation(line: 981, column: 2, scope: !844)
!872 = !DILocation(line: 979, column: 15, scope: !844)
!873 = !DILocation(line: 979, column: 37, scope: !844)
!874 = !DILocation(line: 979, column: 19, scope: !844)
!875 = distinct !DISubprogram(name: "coredns.go.coredns.MsgHdr..eq", linkageName: "go.coredns.go.coredns.MsgHdr..eq", scope: null, file: !9, line: 1, type: !107, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!876 = !DILocalVariable(name: "key1", arg: 1, scope: !875, file: !9, line: 1, type: !43)
!877 = !DILocation(line: 0, scope: !875)
!878 = !DILocalVariable(name: "key2", arg: 2, scope: !875, file: !9, line: 1, type: !43)
!879 = !DILocalVariable(name: "$ret171", scope: !875, file: !9, line: 1, type: !14)
!880 = !DILocation(line: 1, column: 1, scope: !875)
!881 = distinct !DISubprogram(name: "coredns.go.coredns.Question..eq", linkageName: "go.coredns.go.coredns.Question..eq", scope: null, file: !9, line: 1, type: !107, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!882 = !DILocalVariable(name: "key1", arg: 1, scope: !881, file: !9, line: 1, type: !43)
!883 = !DILocation(line: 0, scope: !881)
!884 = !DILocalVariable(name: "key2", arg: 2, scope: !881, file: !9, line: 1, type: !43)
!885 = !DILocalVariable(name: "$ret172", scope: !881, file: !9, line: 1, type: !14)
!886 = !DILocation(line: 1, column: 1, scope: !881)
!887 = distinct !DISubprogram(name: "coredns.ServeDNS.go.coredns.File", linkageName: "go.coredns.File.ServeDNS", scope: null, file: !54, line: 32, type: !888, scopeLine: 32, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!888 = !DISubroutineType(types: !889)
!889 = !{!890, !903, !903, !962, !1026, !714}
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !11, size: 192, align: 8, elements: !891)
!891 = !{!892, !893}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !11, line: 21, baseType: !35, size: 64, align: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !11, line: 21, baseType: !894, size: 128, align: 64, offset: 64)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !9, line: 1, size: 128, align: 8, elements: !895)
!895 = !{!896, !902}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !9, line: 1, baseType: !897, size: 64, align: 64)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !11, size: 128, align: 8, elements: !899)
!899 = !{!900, !901}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !11, line: 1, baseType: !139, size: 64, align: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !11, line: 1, baseType: !313, size: 64, align: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !9, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !54, line: 14, size: 192, align: 8, elements: !905)
!905 = !{!906}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "Zones", file: !54, line: 16, baseType: !907, size: 192, align: 64)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "Zones", file: !54, line: 25, size: 192, align: 8, elements: !908)
!908 = !{!909}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "Z", file: !54, line: 26, baseType: !910, size: 192, align: 64)
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Zone,int,int}", file: !11, size: 192, align: 8, elements: !911)
!911 = !{!912, !76, !77}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !913, size: 64, align: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "Zone", file: !26, line: 543, size: 1728, align: 8, elements: !916)
!916 = !{!917, !918, !919, !920, !939, !946, !947, !948, !953, !954, !956, !959}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "origin", file: !26, line: 544, baseType: !101, size: 128, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "origLen", file: !26, line: 545, baseType: !35, size: 64, align: 64, offset: 128)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "file", file: !26, line: 546, baseType: !101, size: 128, align: 64, offset: 192)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "Tree", file: !26, line: 547, baseType: !921, size: 64, align: 64, offset: 320)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tree", file: !26, line: 654, size: 128, align: 8, elements: !923)
!923 = !{!924, !938}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "Root", file: !26, line: 655, baseType: !925, size: 64, align: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "Node", file: !26, line: 647, size: 256, align: 8, elements: !927)
!927 = !{!928, !934, !935, !936}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "Elem", file: !26, line: 648, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "Elem", file: !26, line: 660, size: 192, align: 8, elements: !931)
!931 = !{!932, !933}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !26, line: 661, baseType: !31, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !26, line: 662, baseType: !101, size: 128, align: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "Left", file: !26, line: 649, baseType: !43, size: 64, align: 64, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "Right", file: !26, line: 649, baseType: !43, size: 64, align: 64, offset: 128)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "Color", file: !26, line: 650, baseType: !937, size: 8, align: 8, offset: 192)
!937 = !DIBasicType(name: "Color", size: 8, encoding: DW_ATE_unsigned)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "Count", file: !26, line: 656, baseType: !35, size: 64, align: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "Apex", file: !26, line: 548, baseType: !940, size: 640, align: 64, offset: 384)
!940 = !DICompositeType(tag: DW_TAG_structure_type, name: "Apex", file: !26, line: 605, size: 640, align: 8, elements: !941)
!941 = !{!942, !943, !944, !945}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "SOA", file: !26, line: 606, baseType: !196, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "NS", file: !26, line: 607, baseType: !743, size: 192, align: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "SIGSOA", file: !26, line: 608, baseType: !743, size: 192, align: 64, offset: 256)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "SIGNS", file: !26, line: 609, baseType: !743, size: 192, align: 64, offset: 448)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "Expired", file: !26, line: 549, baseType: !14, size: 8, align: 8, offset: 1024)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "RWMutex", file: !26, line: 551, baseType: !50, size: 192, align: 32, offset: 1056)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "StartupOnce", file: !26, line: 553, baseType: !949, size: 96, align: 32, offset: 1248)
!949 = !DICompositeType(tag: DW_TAG_structure_type, name: "Once", file: !54, line: 6, size: 96, align: 8, elements: !950)
!950 = !{!951, !952}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "done", file: !54, line: 6, baseType: !41, size: 32, align: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "m", file: !54, line: 6, baseType: !53, size: 64, align: 32, offset: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "TransferFrom", file: !26, line: 554, baseType: !97, size: 192, align: 64, offset: 1344)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ReloadInterval", file: !26, line: 556, baseType: !955, size: 64, align: 64, offset: 1536)
!955 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "reloadShutdown", file: !26, line: 557, baseType: !957, size: 64, align: 64, offset: 1600)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !9, line: 1, align: 8, elements: !5)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "Upstream", file: !26, line: 559, baseType: !960, size: 64, align: 64, offset: 1664)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DICompositeType(tag: DW_TAG_structure_type, name: "Upstream", file: !26, line: 578, align: 8, elements: !5)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !54, line: 5, size: 128, align: 8, elements: !963)
!963 = !{!964, !1025}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !54, line: 5, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void).net/http.http2closeWaiter,*func(*void)error,*func(*void,PrivateKey)PrivateKey}", file: !11, size: 320, align: 8, elements: !967)
!967 = !{!968, !969, !1010, !1014, !1018}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !11, line: 5, baseType: !139, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !11, line: 5, baseType: !970, size: 64, align: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!973, !43}
!973 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !11, size: 256, align: 8, elements: !974)
!974 = !{!975, !1009}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !11, line: 5, baseType: !976, size: 192, align: 64)
!976 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !54, line: 5, size: 192, align: 8, elements: !977)
!977 = !{!978, !979, !981}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !54, line: 5, baseType: !23, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !54, line: 5, baseType: !980, size: 64, align: 64, offset: 64)
!980 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !54, line: 5, baseType: !982, size: 64, align: 64, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !54, line: 5, size: 704, align: 8, elements: !984)
!984 = !{!985, !986, !995, !1006, !1007, !1008}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !54, line: 5, baseType: !101, size: 128, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !54, line: 5, baseType: !987, size: 192, align: 64, offset: 128)
!987 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !11, size: 192, align: 8, elements: !988)
!988 = !{!989, !76, !77}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !54, line: 5, size: 256, align: 8, elements: !992)
!992 = !{!985, !993, !994}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !54, line: 5, baseType: !35, size: 64, align: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !54, line: 5, baseType: !14, size: 8, align: 8, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !54, line: 5, baseType: !996, size: 192, align: 64, offset: 320)
!996 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !11, size: 192, align: 8, elements: !997)
!997 = !{!998, !76, !77}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !54, line: 5, size: 128, align: 8, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !54, line: 5, baseType: !980, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !54, line: 5, baseType: !17, size: 8, align: 8, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !54, line: 5, baseType: !14, size: 8, align: 8, offset: 72)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !54, line: 5, baseType: !14, size: 8, align: 8, offset: 80)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !54, line: 5, baseType: !980, size: 64, align: 64, offset: 512)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !54, line: 5, baseType: !980, size: 64, align: 64, offset: 576)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !54, line: 5, baseType: !990, size: 64, align: 64, offset: 640)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !11, line: 5, baseType: !14, size: 8, align: 8, offset: 192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !11, line: 5, baseType: !1011, size: 64, align: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!957, !43}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !11, line: 5, baseType: !1015, size: 64, align: 64, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!894, !43}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !11, line: 5, baseType: !1019, size: 64, align: 64, offset: 256)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!1022, !43, !1022}
!1022 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrivateKey", file: !26, line: 6, size: 128, align: 8, elements: !1023)
!1023 = !{!1024, !182}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !26, line: 1, baseType: !139, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !54, line: 1, baseType: !43, size: 64, align: 64, offset: 64)
!1026 = !DICompositeType(tag: DW_TAG_structure_type, name: "ResponseWriter", file: !26, line: 13, size: 128, align: 8, elements: !1027)
!1027 = !{!1028, !182}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !26, line: 13, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void)void,*func(*void)Addr,*func(*void)Addr,*func(*void)error,*func(*void,bool)void,*func(*void,struct{*uint8,int,int})struct{int,error},*func(*void,*Msg)error}", file: !11, size: 576, align: 8, elements: !1031)
!1031 = !{!1032, !1033, !1034, !1038, !1051, !1052, !1053, !1057, !1064}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !11, line: 13, baseType: !139, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !11, line: 13, baseType: !1015, size: 64, align: 64, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "Hijack", file: !11, line: 13, baseType: !1035, size: 64, align: 64, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!44, !43}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "LocalAddr", file: !11, line: 13, baseType: !1039, size: 64, align: 64, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!1042, !43}
!1042 = !DICompositeType(tag: DW_TAG_structure_type, name: "Addr", file: !54, line: 6, size: 128, align: 8, elements: !1043)
!1043 = !{!1044, !1025}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !54, line: 6, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string,*func(*void)string}", file: !11, size: 192, align: 8, elements: !1047)
!1047 = !{!1048, !1049, !1050}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !11, line: 6, baseType: !139, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "Network", file: !11, line: 6, baseType: !313, size: 64, align: 64, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "String", file: !11, line: 6, baseType: !313, size: 64, align: 64, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !11, line: 13, baseType: !1039, size: 64, align: 64, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "TsigStatus", file: !11, line: 13, baseType: !1015, size: 64, align: 64, offset: 320)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "TsigTimersOnly", file: !11, line: 13, baseType: !1054, size: 64, align: 64, offset: 384)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!44, !43, !14}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "Write", file: !11, line: 13, baseType: !1058, size: 64, align: 64, offset: 448)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!890, !43, !1061}
!1061 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !11, size: 192, align: 8, elements: !1062)
!1062 = !{!1063, !76, !77}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !11, line: 1, baseType: !104, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "WriteMsg", file: !11, line: 13, baseType: !1065, size: 64, align: 64, offset: 512)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!894, !43, !714}
!1068 = !DILocalVariable(name: "state", scope: !1069, file: !54, line: 33, type: !1070)
!1069 = distinct !DILexicalBlock(scope: !887, file: !54, line: 32, column: 1)
!1070 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !26, line: 256, size: 1024, align: 8, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1075, !1076, !1077, !1079, !1080, !1081, !1082, !1083}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "Req", file: !26, line: 257, baseType: !714, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "W", file: !26, line: 258, baseType: !1026, size: 128, align: 64, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "Zone", file: !26, line: 261, baseType: !101, size: 128, align: 64, offset: 192)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !26, line: 265, baseType: !39, size: 16, align: 16, offset: 320)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "do", file: !26, line: 266, baseType: !14, size: 8, align: 8, offset: 336)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "family", file: !26, line: 269, baseType: !1078, size: 8, align: 8, offset: 344)
!1078 = !DIBasicType(name: "int8", size: 8, encoding: DW_ATE_signed)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !26, line: 270, baseType: !101, size: 128, align: 64, offset: 384)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ip", file: !26, line: 271, baseType: !101, size: 128, align: 64, offset: 512)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "port", file: !26, line: 272, baseType: !101, size: 128, align: 64, offset: 640)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "localPort", file: !26, line: 273, baseType: !101, size: 128, align: 64, offset: 768)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "localIP", file: !26, line: 274, baseType: !101, size: 128, align: 64, offset: 896)
!1084 = !DILocation(line: 33, column: 2, scope: !887)
!1085 = !DILocalVariable(name: "pointer", arg: 1, scope: !887, file: !54, line: 32, type: !903)
!1086 = !DILocation(line: 0, scope: !887)
!1087 = !DILocalVariable(name: "ctx", arg: 2, scope: !887, file: !54, line: 32, type: !962)
!1088 = !DILocalVariable(name: "w", arg: 3, scope: !887, file: !54, line: 32, type: !1026)
!1089 = !DILocalVariable(name: "r", arg: 4, scope: !887, file: !54, line: 32, type: !714)
!1090 = !DILocation(line: 32, column: 1, scope: !887)
!1091 = !DILocalVariable(name: "f", scope: !887, file: !54, line: 32, type: !904)
!1092 = !DILocalVariable(name: "$ret0", scope: !887, file: !54, line: 32, type: !35)
!1093 = !DILocation(line: 33, column: 11, scope: !1069)
!1094 = !DILocation(line: 35, column: 16, scope: !1069)
!1095 = !DILocalVariable(name: "qname", scope: !1069, file: !54, line: 35, type: !101)
!1096 = !DILocation(line: 37, column: 22, scope: !1069)
!1097 = !DILocation(line: 37, column: 7, scope: !1069)
!1098 = !DILocalVariable(name: "z", scope: !1069, file: !54, line: 37, type: !914)
!1099 = !DILocation(line: 39, column: 7, scope: !1069)
!1100 = !DILocation(line: 40, column: 3, scope: !1069)
!1101 = !DILocation(line: 44, column: 10, scope: !1069)
!1102 = !DILocation(line: 44, column: 19, scope: !1069)
!1103 = !DILocation(line: 44, column: 39, scope: !1069)
!1104 = !DILocation(line: 44, column: 48, scope: !1069)
!1105 = !DILocation(line: 45, column: 3, scope: !1069)
!1106 = !DILocation(line: 80, column: 32, scope: !1069)
!1107 = !DILocalVariable(name: "answer", scope: !1069, file: !54, line: 80, type: !743)
!1108 = !DILocalVariable(name: "ns", scope: !1069, file: !54, line: 80, type: !743)
!1109 = !DILocalVariable(name: "extra", scope: !1069, file: !54, line: 80, type: !743)
!1110 = !DILocalVariable(name: "result", scope: !1069, file: !54, line: 80, type: !1111)
!1111 = !DIBasicType(name: "Result", size: 64, encoding: DW_ATE_signed)
!1112 = !DILocalVariable(name: "m", scope: !1069, file: !54, line: 82, type: !714)
!1113 = !DILocation(line: 83, column: 3, scope: !1069)
!1114 = !DILocation(line: 84, column: 3, scope: !1069)
!1115 = !DILocation(line: 84, column: 18, scope: !1069)
!1116 = !DILocation(line: 85, column: 3, scope: !1069)
!1117 = !DILocation(line: 85, column: 26, scope: !1069)
!1118 = !DILocation(line: 85, column: 13, scope: !1069)
!1119 = !DILocation(line: 85, column: 19, scope: !1069)
!1120 = !DILocation(line: 91, column: 4, scope: !1069)
!1121 = !DILocation(line: 91, column: 11, scope: !1069)
!1122 = !DILocation(line: 93, column: 19, scope: !1069)
!1123 = !DILocation(line: 98, column: 11, scope: !1069)
!1124 = !DILocation(line: 98, column: 20, scope: !1069)
!1125 = !DILocation(line: 99, column: 4, scope: !1069)
!1126 = !DILocation(line: 102, column: 4, scope: !1069)
!1127 = !DILocation(line: 102, column: 11, scope: !1069)
!1128 = !DILocation(line: 109, column: 5, scope: !1069)
!1129 = !DILocation(line: 110, column: 2, scope: !1069)
!1130 = distinct !DISubprogram(name: "coredns.Name..1go.coredns.Elem", linkageName: "go.coredns.Elem.Name", scope: null, file: !54, line: 605, type: !1131, scopeLine: 605, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!101, !929, !929}
!1133 = !DILocalVariable(name: "e", arg: 1, scope: !1130, file: !54, line: 605, type: !929)
!1134 = !DILocation(line: 0, scope: !1130)
!1135 = !DILocalVariable(name: "$ret27", scope: !1130, file: !54, line: 605, type: !101)
!1136 = !DILocation(line: 606, column: 6, scope: !1130)
!1137 = !DILocation(line: 606, column: 12, scope: !1130)
!1138 = !DILocation(line: 607, column: 3, scope: !1130)
!1139 = !DILocalVariable(name: "rrs", scope: !1140, file: !54, line: 615, type: !743)
!1140 = distinct !DILexicalBlock(scope: !1130, file: !54, line: 615, column: 2)
!1141 = !DILocation(line: 615, column: 23, scope: !1140)
!1142 = !DILocation(line: 615, column: 2, scope: !1140)
!1143 = !DILocation(line: 616, column: 18, scope: !1140)
!1144 = !DILocation(line: 616, column: 4, scope: !1140)
!1145 = !DILocation(line: 616, column: 27, scope: !1140)
!1146 = !DILocation(line: 616, column: 15, scope: !1140)
!1147 = !DILocation(line: 616, column: 10, scope: !1140)
!1148 = !DILocation(line: 617, column: 3, scope: !1140)
!1149 = !DILocation(line: 619, column: 2, scope: !1130)
!1150 = distinct !DISubprogram(name: "coredns.Type..1go.coredns.Elem", linkageName: "go.coredns.Elem.Type", scope: null, file: !54, line: 602, type: !1151, scopeLine: 602, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!743, !929, !929, !39}
!1153 = !DILocalVariable(name: "e", arg: 1, scope: !1150, file: !54, line: 602, type: !929)
!1154 = !DILocation(line: 0, scope: !1150)
!1155 = !DILocalVariable(name: "qtype", arg: 2, scope: !1150, file: !54, line: 602, type: !39)
!1156 = !DILocation(line: 602, column: 60, scope: !1150)
!1157 = !DILocation(line: 602, column: 62, scope: !1150)
!1158 = !DILocation(line: 602, column: 52, scope: !1150)
!1159 = distinct !DISubprogram(name: "coredns.TypeForWildcard..1go.coredns.Elem", linkageName: "go.coredns.Elem.TypeForWildcard", scope: null, file: !54, line: 623, type: !1160, scopeLine: 623, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !5)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!743, !929, !929, !39, !101}
!1162 = !DILocalVariable(name: "e", arg: 1, scope: !1159, file: !54, line: 623, type: !929)
!1163 = !DILocation(line: 0, scope: !1159)
!1164 = !DILocalVariable(name: "qtype", arg: 2, scope: !1159, file: !54, line: 623, type: !39)
